geoblogger/app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
    @posts = Post.find_all_by_event_id(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `posts` WHERE (`posts`.`event_id` = '1')

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`event_id`, `updated_at`, `title`, `description`, `user_id`, `location`, `created_at`) VALUES(NULL, '2009-04-23 10:43:01', 'Trip to Spain', 'Spring quarter in Spain! I was based in Madrid but was able to go around the whole country.', NULL, 'Spain', '2009-04-23 10:43:01')