geoblogger/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`event_id`, `latitude`, `updated_at`, `title`, `description`, `longitude`, `user_id`, `location`, `created_at`) VALUES(1, 40.491482267884, '2009-04-23 10:59:38', 'Arrival in Madrid!', 'After about an 8 hour plane ride I am finally here! Woot!', -3.59391331672668, 1, 'Barajas Airport, Madrid', '2009-04-23 10:59:38')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `latitude` = 40.4967312171421, `longitude` = -3.59956741333008, `updated_at` = '2009-04-23 11:17:57' WHERE `id` = 1