geoblogger/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @events = Event.find_all_by_user_id(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 0)
SELECT * FROM `events` WHERE (`events`.`user_id` = '1')

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`salt`, `updated_at`, `facebook_id`, `hashed_password`, `gender`, `first_name`, `last_name`, `email_address`, `created_at`) VALUES('188740100.00967500115914621', '2009-04-23 05:03:42', 6235452, '0b44744ea9ee3455d3c97664336ab42cef5227f1', 'male', 'Jorge', 'Miramontes', 'georgemiramontes@gmail.com', '2009-04-23 05:03:42')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `gender` = 'male', `updated_at` = '2009-04-23 09:34:47' WHERE `id` = 1